000100050517            05       INF-CODE               PIC X(2).
000200050517            05       INF-VALEUR             PIC 9(3)V9(6).
000300050517            05       INF-LIBELLE            PIC X(50).
000400050517            05       INF-DATE               PIC X(10).
000401150903
000402150903
